performance/pg_tileserv.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree><TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="pg_tileserv vector tile benchmark"><elementProp name="TestPlan.user_defined_variables" elementType="Arguments"/></TestPlan><hashTree>
    <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="${__P(scenario,single_tile)}"><intProp name="ThreadGroup.num_threads">${__P(threads,1)}</intProp><intProp name="ThreadGroup.ramp_time">1</intProp><elementProp name="ThreadGroup.main_controller" elementType="LoopController"><stringProp name="LoopController.loops">${__P(loops,20)}</stringProp><boolProp name="LoopController.continue_forever">false</boolProp></elementProp></ThreadGroup><hashTree>
      <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="pg_tileserv_tile"><stringProp name="HTTPSampler.domain">${__P(host,localhost)}</stringProp><stringProp name="HTTPSampler.port">${__P(port,7800)}</stringProp><stringProp name="HTTPSampler.protocol">http</stringProp><stringProp name="HTTPSampler.path">/public.sample_features/${__P(z,6)}/${__P(x,52)}/${__P(y,26)}.pbf</stringProp><stringProp name="HTTPSampler.method">GET</stringProp><boolProp name="HTTPSampler.follow_redirects">true</boolProp></HTTPSamplerProxy><hashTree/>
    </hashTree>
  </hashTree></hashTree>
</jmeterTestPlan>